УТ_для_edt.РасширениеСмарт/src/Enums/ЦветаЗаметок/ЦветаЗаметок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦветаЗаметок</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Зеленый</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Голубой</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Синий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Оранжевый</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Фиолетовый</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Красный</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Желтый</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Заметки/Заметки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Заметки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекстСодержания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Пометка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДляРабочегоСтола</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаЗаметки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПредставлениеПредмета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9cca9751-c599-4906-ad10-d4c17fd84503">
    <name>смартКвалификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/CommonModules/CRM_РабочийСтолСервер/Module.bsl
//++ #1443 смарт: Фролов 20.09.2023 //Добработать Интерес, чтобы было видно заметки по клиенту и возможность создать заметку по клиенту.
//Функция ЗаметкиПользователя(Знач ТекущийПользователь = Неопределено) Экспорт
//++ #1443 смарт: Ермаков 26.09.2023 // Добработать Интерес, чтобы было видно заметки по клиенту и возможность создать заметку по клиенту.
// Добавил параметр МассивПредметов  
//++ #1571 смарт: Мосолов 07.12.2023 // Рефакторинг.
// Заменил ЗаметкиПользователя() с доп парметром  
Функция ЗаметкиПользователя_Расширенная(Знач ТекущийПользователь = Неопределено, МассивПредметов = Неопределено) Экспорт
//-- #1443 смарт: Фролов 20.09.2023	

	Если ТекущийПользователь = Неопределено Тогда
		ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	КонецЕсли;	
	
	МассивЗаметок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникЗаметки.Ссылка КАК Ссылка,
		|	СправочникЗаметки.ПометкаУдаления КАК ПометкаУдаления,
		|	СправочникЗаметки.Предопределенный КАК Предопределенный,
		|	СправочникЗаметки.Наименование КАК Наименование,
		|	СправочникЗаметки.Автор КАК Автор,
		|	СправочникЗаметки.Содержание КАК Содержание,
		|	СправочникЗаметки.ТекстСодержания КАК ТекстСодержания,
		|	СправочникЗаметки.ДляРабочегоСтола КАК ДляРабочегоСтола,
		|	ВЫБОР
		|		КОГДА СправочникЗаметки.Пометка = ЗНАЧЕНИЕ(Перечисление.ЦветаЗаметок.Красный)
		|			ТОГДА ""red""
		|		КОГДА СправочникЗаметки.Пометка = ЗНАЧЕНИЕ(Перечисление.ЦветаЗаметок.Оранжевый)
		|			ТОГДА ""orange""
		|		КОГДА СправочникЗаметки.Пометка = ЗНАЧЕНИЕ(Перечисление.ЦветаЗаметок.Желтый)
		|			ТОГДА ""yellow""
		|		КОГДА СправочникЗаметки.Пометка = ЗНАЧЕНИЕ(Перечисление.ЦветаЗаметок.Зеленый)
		|			ТОГДА ""green""
		|		КОГДА СправочникЗаметки.Пометка = ЗНАЧЕНИЕ(Перечисление.ЦветаЗаметок.Голубой)
		|			ТОГДА ""lightblue""
		|		КОГДА СправочникЗаметки.Пометка = ЗНАЧЕНИЕ(Перечисление.ЦветаЗаметок.Синий)
		|			ТОГДА ""blue""
		|		КОГДА СправочникЗаметки.Пометка = ЗНАЧЕНИЕ(Перечисление.ЦветаЗаметок.Фиолетовый)
		|			ТОГДА ""violet""
		|	КОНЕЦ КАК ЦветСтиля,
		|	СправочникЗаметки.ПредставлениеПредмета КАК ПредставлениеПредмета,
		|	СправочникЗаметки.ДатаИзменения КАК ДатаИзменения
		|ИЗ
		|	Справочник.Заметки КАК СправочникЗаметки
		|ГДЕ
		|	НЕ СправочникЗаметки.ПометкаУдаления
		|	И СправочникЗаметки.Автор = &Пользователь
		|	И СправочникЗаметки.ДляРабочегоСтола = ИСТИНА";

	//++ #1443 смарт: Ермаков 26.09.2023 // Добработать Интерес, чтобы было видно заметки по клиенту и возможность создать заметку по клиенту.
	// В массиве может быть несколько элементов сравнения
	Если Не МассивПредметов = Неопределено Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СправочникЗаметки.Автор = &Пользователь", "");  
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СправочникЗаметки.ДляРабочегоСтола = ИСТИНА", "");  
		
		Запрос.Текст = Запрос.Текст + " И СправочникЗаметки.Предмет В (&МассивПредметов)";
		Запрос.УстановитьПараметр("МассивПредметов", МассивПредметов);	
		
	КонецЕсли;
	//-- #1443 смарт: Ермаков 26.09.2023 // Добработать Интерес, чтобы было видно заметки по клиенту и возможность создать заметку по клиенту.
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		СтруктураЭлемента = Новый Структура;
		Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
			СтруктураЭлемента.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
		КонецЦикла;
		
		СтруктураЭлемента.Вставить("ИдентификаторСсылки", XMLСтрока(Выборка.Ссылка));
		
		МассивЗаметок.Добавить(СтруктураЭлемента);
		
	КонецЦикла;
	
	Возврат МассивЗаметок;
	
КонецФункции // ЗаметкиПользователя()
